#### Day 2: CREATE Statement and Basic SELECT Statements ðŸ“Š




Today we cover CREATE TABLE and basic SELECT queries.

#### 1. Database Connection

In [2]:
import mysql.connector
import pandas as pd

conn = mysql.connector.connect(
    host="localhost",
    user="root",
    password="",
    database="30_Days_SQL"
)
cursor = conn.cursor()
print("Connected to '30_Days_SQL'!")

Connected to 'sql_30days_challenge'!

#### 2. Practice Exercise 1: Create products table
**Structure:**
- product_id (INT PRIMARY KEY)
- product_name (VARCHAR(50), NOT NULL)
- price (DECIMAL(10, 2))
- stock_quantity (INT)

In [3]:
cursor.execute("DROP TABLE IF EXISTS products")
cursor.execute('''
CREATE TABLE products (
    product_id INT PRIMARY KEY,
    product_name VARCHAR(50) NOT NULL,
    price DECIMAL(10, 2),
    stock_quantity INT
)
''')
print("Products table created!")

Products table created!

#### 3. Practice Exercise 2: Insert data into students table
First, we create the students table as defined in the lesson.

In [4]:
cursor.execute("DROP TABLE IF EXISTS students")
cursor.execute('''
CREATE TABLE students (
    student_id INT PRIMARY KEY,
    name VARCHAR(100) NOT NULL,
    age INT,
    enrollment_date DATE
)
''')

students_data = [
    (101, 'Alice Johnson', 20, '2023-01-15'),
    (102, 'Bob Williams', 22, '2023-02-10'),
    (103, 'Charlie Davis', 21, '2023-03-05')
]
cursor.executemany("INSERT INTO students VALUES (%s, %s, %s, %s)", students_data)
conn.commit()
print("Data inserted into students table!")

Data inserted into students table!

#### 4. Practice Exercise 3: Retrieve name and department from employees
First, we create the employees table with sample data.

In [5]:
cursor.execute("DROP TABLE IF EXISTS employees")
cursor.execute('''
CREATE TABLE employees (
    id INT PRIMARY KEY,
    name VARCHAR(100),
    age INT,
    department VARCHAR(100),
    salary INT
)
''')

employees_data = [
    (1, 'John Doe', 30, 'HR', 50000),
    (2, 'Jane Smith', 25, 'IT', 60000),
    (3, 'Sam Brown', 35, 'Marketing', 55000),
    (4, 'Lisa Wong', 28, 'IT', 70000),
    (5, 'Mark Lee', 32, 'Marketing', 45000)
]
cursor.executemany("INSERT INTO employees VALUES (%s, %s, %s, %s, %s)", employees_data)
conn.commit()

query = "SELECT name, department FROM employees"
df = pd.read_sql(query, conn)
df

C:\Users\lenovo\AppData\Local\Temp\ipykernel_18904\2100748770.py:23: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  df = pd.read_sql(query, conn)

         name department
0    John Doe         HR
1  Jane Smith         IT
2   Sam Brown  Marketing
3   Lisa Wong         IT
4    Mark Lee  Marketing

#### 5. Practice Exercise 4: Retrieve all rows from students

In [6]:
query = "SELECT * FROM students"
df = pd.read_sql(query, conn)
df

C:\Users\lenovo\AppData\Local\Temp\ipykernel_18904\2374959561.py:2: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  df = pd.read_sql(query, conn)

   student_id           name  age enrollment_date
0         101  Alice Johnson   20      2023-01-15
1         102   Bob Williams   22      2023-02-10
2         103  Charlie Davis   21      2023-03-05

In [7]:
conn.close()